{
  "app": {
    "name": "Art Evoke"
  },
  "navbar": {
    "home": "Home",
    "about": "About",
    "memoryReconstruction": "Memory Reconstruction",
    "artExploration": "Art Exploration",
    "profile": "Profile",
    "logout": "Logout",
    "account": "Account",
    "signUp": "Sign Up",
    "login": "Login",
    "accessibility": "Accessibility"
  },
  "buttons": {
    "submit": "Submit",
    "cancel": "Cancel",
    "save": "Save",
    "back": "Back",
    "next": "Next",
    "search": "Search",
    "clear": "Clear",
    "delete": "Delete",
    "edit": "Edit"
  },
  "footer": {
    "rights": "All rights reserved",
    "contact": "Contact",
    "privacy": "Privacy Policy",
    "terms": "Terms of Service",
    "copyright": "Marc Bejjani, Augusto Barbosa Villar Silva.",
    "university": "Université Catholique de Louvain, EPL",
    "supervisor": "Thesis Supervisor: Benoît Macq"
  },
  "language": {
    "select": "Select Language",
    "english": "English",
    "portuguese": "Portuguese"
  },
  "accessibility": {
    "fontSize": "Font Size",
    "theme": "Theme",
    "readAloud": "Read Aloud",
    "highContrast": "High Contrast"
  },
  "about": {
    "title": "About Us",
    "paragraph1": "This website is created in the context of a Masters Thesis at the Université Catholique de Louvain, undertaken by Marc Bejjani and Augusto Barbosa Villar Silva, under the supervision of Professor Benoît Macq.",
    "paragraph2": "This thesis explores how artificial intelligence can support non-drug interventions for people living with Alzheimer's disease (AD) through the use of visual stimuli and art. We present a prototype platform that combines large multimodal models (LMMs), large language models (LLMs), and embedding-based vector search to connect personal stories with curated artworks. Designed to assist memory recall and cognitive engagement, ArtEvoke generates personalized visual narratives or retrieves relevant paintings based on the user's story. Art is used not only as a memory trigger but also as a tool to promote emotional connection and engagement. The prototype is intended for testing in future therapeutic and research settings, particularly as a scalable support tool for caregivers and clinical practitioners. We evaluate model performance, retrieval effectiveness using FAISS, and user interaction design with a focus on accessibility. These findings highlight the potential of AI tools to support scalable cognitive stimulation in dementia care."
  },
  "home": {
    "heroTitle": "Welcome to our Art Evoke application!",
    "heroDescription": "This website allows you to interact with different AI models that can suggest different paintings based on a provided story, or generate a story based on selected art. To get started, please click on one of the two options down below!",
    "memoryReconstruction": "Memory Reconstruction",
    "memoryReconstructionDesc": "Generate Images from a Story",
    "artExploration": "Art Exploration", 
    "artExplorationDesc": "Search for Art using Keywords"
  },
  "login": {
    "title": "Login",
    "username": "Username:",
    "password": "Password:",
    "submit": "Login",
    "createAccount": "Or create an account if you aren't registered",
    "errorInvalid": "Invalid username or password",
    "errorGeneral": "Something went wrong. Please try again later."
  }
}
