{
  "app": {
    "name": "Art Evoke"
  },
  "navbar": {
    "home": "Início",
    "about": "Sobre",
    "memoryReconstruction": "Reconstrução de Memória",
    "artExploration": "Exploração de Arte",
    "profile": "Perfil",
    "logout": "Sair",
    "account": "Conta",
    "signUp": "Cadastrar",
    "login": "Entrar",
    "accessibility": "Acessibilidade"
  },
  "buttons": {
    "submit": "Enviar",
    "cancel": "Cancelar",
    "save": "Salvar",
    "back": "Voltar",
    "next": "Próximo",
    "search": "Buscar",
    "clear": "Limpar",
    "delete": "Excluir",
    "edit": "Editar"
  },
  "footer": {
    "rights": "Todos os direitos reservados",
    "contact": "Contato",
    "privacy": "Política de Privacidade",
    "terms": "Termos de Serviço",
    "copyright": "Marc Bejjani, Augusto Barbosa Villar Silva.",
    "university": "Université Catholique de Louvain, EPL",
    "supervisor": "Orientador da Tese: Benoît Macq"
  },
  "language": {
    "select": "Selecionar Idioma",
    "english": "Inglês",
    "portuguese": "Português"
  },
  "accessibility": {
    "fontSize": "Tamanho da Fonte",
    "theme": "Tema",
    "readAloud": "Leitura em Voz Alta",
    "highContrast": "Alto Contraste"
  },
  "about": {
    "title": "Sobre Nós",
    "paragraph1": "Este site foi criado no contexto de uma Tese de Mestrado na Université Catholique de Louvain, desenvolvida por Marc Bejjani e Augusto Barbosa Villar Silva, sob a supervisão do Professor Benoît Macq.",
    "paragraph2": "Esta tese explora como a inteligência artificial pode apoiar intervenções não medicamentosas para pessoas que vivem com a doença de Alzheimer (DA) através do uso de estímulos visuais e arte. Apresentamos uma plataforma protótipo que combina grandes modelos multimodais (LMMs), grandes modelos de linguagem (LLMs) e busca vetorial baseada em embeddings para conectar histórias pessoais com obras de arte curadas. Projetado para auxiliar na recuperação de memória e engajamento cognitivo, o ArtEvoke gera narrativas visuais personalizadas ou recupera pinturas relevantes baseadas na história do usuário. A arte é usada não apenas como um gatilho de memória, mas também como uma ferramenta para promover conexão emocional e engajamento. O protótipo é destinado para testes em ambientes terapêuticos e de pesquisa futuros, particularmente como uma ferramenta de apoio escalável para cuidadores e profissionais clínicos. Avaliamos o desempenho do modelo, efetividade de recuperação usando FAISS e design de interação do usuário com foco em acessibilidade. Estes achados destacam o potencial das ferramentas de IA para apoiar estimulação cognitiva escalável no cuidado da demência."
  },
  "home": {
    "heroTitle": "Bem-vindos à nossa aplicação Art Evoke!",
    "heroDescription": "Este site permite que você interaja com diferentes modelos de IA que podem sugerir diferentes pinturas baseadas em uma história fornecida, ou gerar uma história baseada em arte selecionada. Para começar, por favor clique em uma das duas opções abaixo!",
    "memoryReconstruction": "Reconstrução de Memória",
    "memoryReconstructionDesc": "Gerar Imagens a partir de uma História",
    "artExploration": "Exploração de Arte",
    "artExplorationDesc": "Buscar Arte usando Palavras-chave"
  },
  "login": {
    "title": "Entrar",
    "username": "Nome de usuário:",
    "password": "Senha:",
    "submit": "Entrar",
    "createAccount": "Ou crie uma conta se você não está registrado",
    "errorInvalid": "Nome de usuário ou senha inválidos",
    "errorGeneral": "Algo deu errado. Por favor, tente novamente mais tarde."
  }
}
